In [1]:
import numpy as np
import pandas as pd

## Group by operation involves:
- Split
- Apply
- Combine

### Pandas does all of this with a simple method call: groupby()
    DataFrame.groupby(by=None, axis=0, level=None, as_index=True, sort=True, group_keys=True, squeeze=<deprecated>,                                    observed=False, dropna=True)

In [2]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [3]:
df=pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [4]:
df.groupby('Company').mean() #company will now become the new index after the groupby operation

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [5]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [6]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

### The head() function
    In Pandas is used to return the first few rows of a DataFrame or Series. By default, it returns the first 5 rows, but   you can specify the number of rows to return.

In [7]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head(2)

   col1  col2 col3
0     1   444  abc
1     2   555  def

In [8]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [9]:
# To view only unique values in dataframe


print(df['col2'].unique()) 

# To view number of unique values

df['col2'].nunique()

[444 555 666]

3

In [10]:
df['col2'].value_counts() # count number to time each unique value occured

444    2
555    1
666    1
Name: col2, dtype: int64

In [11]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [12]:
# filter using multiple condition

newdf = df[(df['col2'] > 555) & (df['col1'] > 2)]
newdf

   col1  col2 col3
2     3   666  ghi

## Applying function to dataframe
    The apply() function in Pandas is used to apply a function along the axis of a DataFrame (either rows or columns) or on a Series. It is useful when you need to perform operations row-wise or column-wise.
    
    DataFrame.apply(func, axis=0, raw=False, result_type=None, args=(), **kwds)
    
    result_type: Controls the result type:
        'expand': Return a DataFrame.
        'reduce': Return a Series.
        'broadcast': Broadcast the result to the original DataFrame.

In [13]:
def square(n):
    return n*n

In [14]:
square(9)

81

In [15]:
df['new']=df['col1'].apply(square)
df

   col1  col2 col3  new
0     1   444  abc    1
1     2   555  def    4
2     3   666  ghi    9
3     4   444  xyz   16

In [16]:
df.drop('new',axis=1) # removing the column

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

# Finding the index of the data frame
    "index()" fucntion is an attribute of a DataFrame or Series that provides access to the index labels of the data

In [17]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [18]:
# get only the start index
print(df.index.start)

# to get last index
print(df.index.stop)

0
4

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
 3   new     4 non-null      int64
dtypes: int64(3), object(1)
memory usage: 256.0+ bytes

## Sorting the data frame
    Sorting a DataFrame in Pandas can be done using the sort_values() and sort_index() methods
    
### DataFrame.sort_values(by, axis=0, ascending=True, inplace=False, na_position='last')

In [20]:
df

   col1  col2 col3  new
0     1   444  abc    1
1     2   555  def    4
2     3   666  ghi    9
3     4   444  xyz   16

In [21]:
#Sort by a Single Column (Ascending Order):
    
    
df.sort_values(by='col2')

   col1  col2 col3  new
0     1   444  abc    1
3     4   444  xyz   16
1     2   555  def    4
2     3   666  ghi    9

In [22]:
# Sort by a Single Column (Descending Order):

df.sort_values(by='col2', ascending=False)

   col1  col2 col3  new
2     3   666  ghi    9
1     2   555  def    4
0     1   444  abc    1
3     4   444  xyz   16

In [23]:
# Sort by Multiple Columns:

df.sort_values(by=['col2', 'new'])

   col1  col2 col3  new
0     1   444  abc    1
3     4   444  xyz   16
1     2   555  def    4
2     3   666  ghi    9

## sort_index(): This method sorts the DataFrame by its index.
    DataFrame.sort_index(axis=0, level=None, ascending=True, inplace=False, sort_remaining=True)
    
    axis: Axis to sort along (default is 0 for rows).
    level: Level(s) of a MultiIndex to sort by.
    ascending: Boolean or list of booleans.
    inplace: If True, performs the operation in place.
    sort_remaining: If True, sorts remaining levels in a MultiIndex.

In [24]:
# Sort by Index (Ascending Order):

df.sort_index()

   col1  col2 col3  new
0     1   444  abc    1
1     2   555  def    4
2     3   666  ghi    9
3     4   444  xyz   16

In [25]:
# Sort by Index (Descending Order):

df.sort_index(ascending=False)

   col1  col2 col3  new
3     4   444  xyz   16
2     3   666  ghi    9
1     2   555  def    4
0     1   444  abc    1